# Задание №1.

# s = input("Введите предложение:").lower().replace(" ", "")
#
# reverse_s = s[::-1]
# print(reverse_s)
# if s == reverse_s:
#     print("Строка является полиндромом")
# else:
#     print("Строка не является полиндромом")


# Задание №2.

# text = input("Введите текст: ")
# reserved_words = input("Введите список зарезервированных слов через пробел: ").split()
#
# for word in reserved_words:
#     text = text.replace(word, word.upper())
#
# print("Измененный текст:")
# print(text)


# Задание №3.

# import re
#
# text = input("Введите текст: ")
# sentences = re.split(r'[.!?]+', text)
# sentence_count = len(sentences)
#
# print("Количество предложений:", sentence_count)

